server/app/controllers/publish_histories_controller.rb

SELECT  `shorts`.* FROM `shorts` WHERE `shorts`.`id` = 1 LIMIT 1
SELECT `publish_histories`.* FROM `publish_histories` WHERE `publish_histories`.`short_id` = 1
---
  def index
    @publish_histories = Short.find(params[:short_id]).publish_histories

INSERT INTO `publish_histories` (`short_id`, `tasktype`, `publisher`, `comment`, `created_at`, `updated_at`) VALUES (1, 0, 'ergeg', 'ergegr', '2016-12-07 19:06:11', '2016-12-07 19:06:11')
---
  def create
    @publish_history = PublishHistory.new(publish_history_params)

    if @publish_history.save