server/app/controllers/sequences_controller.rb

SELECT `sequences`.* FROM `sequences`
---
  def index
    @sequences = Sequence.all

SELECT  `sequences`.* FROM `sequences` WHERE `sequences`.`id` = 1 LIMIT 1
---
    def set_sequence
      @sequence = Sequence.find(params[:id])