server/app/controllers/shorts_controller.rb

SELECT  `sequences`.* FROM `sequences` WHERE `sequences`.`id` = 1 LIMIT 1
SELECT `shorts`.* FROM `shorts` WHERE `shorts`.`sequence_id` = 1
---
  def index
    @shorts = Sequence.find(params[:sequence_id]).shorts

SELECT  `shorts`.* FROM `shorts` WHERE `shorts`.`id` = 1 LIMIT 1
---
    def set_short
      @short = Short.find(params[:id])