server/app/controllers/shorts_controller.rb

SELECT `shorts`.* FROM `shorts`
---
  def index
    @shorts = Short.all